using System;

namespace ConsoleApp4
{
    class Program
    {
        static void Main(string[] args)
        {

            /* Пред потребителя в конзолата се изписва "Enter Income!" и от него се иска да въведе число, след което се записва в променлива и се създават още няколко променливи  */

            Console.WriteLine("Enter Salary!");
            double n = Convert.ToInt32(Console.ReadLine());
            double x = 0;
            double z = 0;
            double m = 0;

            /* Прави се проверка дали въведеното число е по-малко или равно на 1000*/

            if (n >= 1000)
            {

                /* Ако числото е по-малко или равно на 1000 в посочената променлива се записват 10% от него*/

                z = (n - 1000) * 0.1;

                /*Проверява се дали въведеното от потребителя число е по-голямо или равно на хиляда */

                if (n >= 2000)
                {

                    /*На определената променлива й се дава стойност, за да се начисли осигуровката*/

                    m = 300;
                }

                /*Пресмята се стойността на заплатата след таксуването и се изписва пред потребителя в конзолата*/

                x = n - (z + m);

                Console.WriteLine("Salary after taxation: " + x + " IDR");

            }
            else
            {

                /*При заплата по-малка или равна на 1000 се изкарва пред потребителя по посочения начин*/

                Console.WriteLine("Salary after taxation: " + n + " IDR");

            }
        }

        /* Относно допълнителни данъци или видове таксуване, 
         * смятам че трябва да се промени начина на смятане 
         * на осигуровката. Не е рационално индивид с месечен 
         * доход 20000 IDR да плаща същите осигуровки като индивид
         * с 3000 IDR. Индивидите с доходи до 3000 IDR ще 
         * плащат 5% за осигуровки, а на всеки 5000 IDR ще се
         * плащат с 5% повече, докато се достигне лимит от 15%. 
         * Възможно е да се добави данък за високи доходи,
         * който започва от 10000 IDR, равен на 5%, стигащ 
         * до 20000 IDR, където данъка ще бъде 10%. */
    }
}